OpenFOAM/4.x/ERCOFTAC-SIG15/case13.1/alpha_16.2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.2;

boundaryField
{
    inlet
    {
        type                mapped;
        interpolationScheme cell;
        setAverage          false;
        average             0;
        value               uniform 14.2;
    }
    outlet
    {
        type            zeroGradient;
    }
    slip
    {
        type            slip;
    }
    rotaingWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    inletWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
